{
  "title": "v1.0.0",
  "subtitle": "",
  "slug": "v1-0-0",
  "section": "releases",
  "url": "/releases/v1-0-0/",
  "body": "Since the first version of InterTrader (formerly *Cryptocurrency Exchange Comparison*) was released on Google Play, **_a lot_** of work has gone into refining and enhancing it to so that it does as much as possible to simplify and speed up the process of finding solid intertrades.\r\n\r\nAs mentioned in the [introduction to intertrading](/what-is-intertrading/ \"What is inter-trading?\"), I've spent a great deal of time (and some crypto) using intertrader to trade, in order to figure the challenges and pitfalls, and then build features into the app that reduce or eliminate them completely. The result is the addition of the following new features in **v1.0.0**:\r\n\r\n* [Profit analysis across 5000+ exchange and trade pair combinations](#profit-analysis)\r\n* [Analysis result filters to refine results](#analysis-results-filters)\r\n* [Orderbooks of exchanges available directly within the app](#orderbooks)\r\n* [Cost calculator accessible on comaprison and orderbook pages](#cost-calculator)\r\n* [Clear indicators on comparison page when profit is available](#profit-indicators)\r\n* [Names of coins on exchanges added (where available) to avoid coin-clash](#coin-names)\r\n* [Removal of unreliable/limited exchanges](#better-quality-exchange-data)\r\n* [Addition of new exchanges](#better-quality-exchange-data)\r\n* [Menu for quick access to guides and online support](#easy-access-to-online-resources)\r\n\r\n## Profit analysis\r\n\r\nOriginally, InterTrader showed you a simple comparison of the prices of a cryptocurrency on different exchanges. While this was useful, to find potentially profitable pairs you had to manually assess each trading pair. In **v1.0.0**, InterTrader does all the calculation for you, returns a list of profitable pairs, and even indicates if there are wallet issues that may affect your trade. This is a *massive* time-saver and makes it much easier to [find profit](/user-guide/finding-profitable-cryptocurrency-pairs/ \"Finding profitable cryptocurrency pairs\").\r\n\r\n## Analysis results filters\r\n\r\nAlong with the profit analysis, InterTrader also allows you to refine your results. Using the search filters, you can set the minimum profit you'd like, adjust the maximum [ buy/sell spread](/user-guide/quick-reference/#glossary-of-intertrader-terms \"Quick reference\"), increase the minimum number of exchanges listing a trade pair, and more. Check out the [guide to refining your search results](/user-guide/finding-profitable-cryptocurrency-pairs/refining-your-search/ \"Refining your search\") for more info.\r\n\r\n## Orderbooks\r\n\r\nOne of the time-consuming parts of intertrading is the process of checking if the exchange has sufficient supply/demand to fulfill a profitable intertrade. This has been spead up by the ability to view the orderbooks for exchanges directly from [the comparison page](/user-guide/compare-page/ \"The Comparison Page\").\r\n\r\n## Cost calculator\r\n\r\nWhile using InterTrader I often found myself wanting to calculate the value of a specific quantity of a coin. Sometimes I wanted to see how much I needed to purchase, or if the amount in the orderbooks would cover my costs. I spent a lot of time with a separate calculator open, or doing the calculations on the exchanges. To save time and avoid the back and forth, [InterTrader now includes a calculator](/user-guide/compare-page/#performing-calculations \"The Comparison Page\") that can be quickly accessed on the comparison and orderbook screens.\r\n\r\n## Profit indicators\r\n\r\nVisual cues have been added to the comparison page to make it obvious when there's potential profit to be made from a trading pair. The most profitable <span class=\"buy\">buy</span> and <span class=\"sell\">sell</span> prices are presented in a LARGER and **bolder** text. You'll also see the <ion-icon name=\"logo-bitcoin\"></ion-icon> at the top of the screen, which you can tap to view the pair's profit analysis.\r\n\r\n## Coin names\r\n\r\nAlthough it doesn't happen _too_ often, I came across a few instances where coins shared the same ticker symbol. To reduce ambiguity, the coin names used on each exchange is presented whenever that information is available. Make sure you pay attention to the coin names (and check for yourself) to avoid a bad intertrade as a result of \"[coin-clash](/user-guide/quick-reference/#glossary-of-intertrader-terms \"Quick reference\")\".\r\n\r\n## Better quality exchange data\r\n\r\nDuring development and testing of InterTrader, it became clear just how much the quality of data available from exchanges varied. There were also other unhealthy signals that meant certain exchanges had to be removed. But InterTrader now has even more exchanges, with the addition of: Bit-Z, Gate.IO and Kucoin!\r\n\r\n## Easy access to online resources\r\n\r\nFor convenience, InterTrader now includes a menu with links to useful resources:\r\n\r\n* <ion-icon name=\"book\"></ion-icon> [User Guide](/user-guide/ \"Learn how to use InterTrader\") \r\n* <ion-icon name=\"chatboxes\"></ion-icon> [Online support](https://discord.gg/QQpAHYn \"Get in touch on Discord\")\r\n* <ion-icon name=\"star\"></ion-icon> [Rate InterTrader](https://play.google.com/store/apps/details?id=club.lambomoon.cec \"Rate the app\")\r\n* <ion-icon name=\"logo-twitter\"></ion-icon> [Tweet LamboMoon!](https://twitter.com/LamboMoonClub \"Get in touch on Twitter\")\r\n\r\n## Enjoy v1.0.0\r\nA lot of thought and work has gone into InterTrader. I wanted to make intertrading as low-risk and accessible as possible. But you still need to keep your wits about you. If you haven't already, I advise that you to read my [introduction to intertrading](/what-is-intertrading/ \"What is inter-trading?\"), so that you understand the problems this app is trying to solve, and how *you* can avoid the potential missteps.\r\n\r\nI hope you enjoy the app. Happy trading!\r\n  \r\n___\r\n> ### InterTrader v1.0.0 will be available on the [Google Play](https://play.google.com/store/apps/details?id=club.lambomoon.cec \"Get the app\") on Friday 8th June, 2018",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2018-06-06T21:26:18.834Z",
  "updated": "2018-06-07T10:15:56.170Z",
  "published": "2018-06-07T10:13:12.609Z",
  "contentType": "page",
  "id": "ByQtZ0reQ"
}