{
  "title": "What is inter-trading?",
  "subtitle": "The art of arbitrage",
  "slug": "what-is-intertrading",
  "section": "",
  "url": "/what-is-intertrading/",
  "body": "*Inter-trading (more commonly known as **arbitrage**) is the process of purchasing a quantity of a cryptocurrency on one exchange and selling it on another exchange at a higher price than the original purchase, thereby making a profit. Instead of trading one coin for another, you trade the same coin between exchanges by withdrawing to the target exchange and selling there (probably, but not necessarily) for the original coin. It's not a new concept in crypto, but this might be the first time an app has been created to facilitate it.*\r\n\r\n## Pivoting from price monitoring to price comparison\r\nWhen I first started working on [InterTrader](/#download) its purpose was to provide price alerts for smaller exchanges such as Stocks.exchange, Cryptopia and SouthXchange. But on developing the prototype and adding a handful of exchanges on which to monitor prices, the variation in price of the same asset across them was almost immediately apparent. Direct comparison became a secondary feature that I would add in order to capitalise on the price differences, but as I spent more time observing the prices, comparison became the primary focus. Even at this point, I was only vaguely aware of the idea of inter-trading and certainly didn't have a name for it. \r\n\r\n## What are the benefits of inter-trading?\r\n\r\nInter-trading is a great way to effectively earn interest on crypto that you might have sitting on an exchange, just waiting for a great opportunity. If you're trading crypto it's not unusual to be signed up on half-a-dozen to a dozen different exchanges, to ensure broad coin coverage and maximum opportunity. You can leverage these accounts by inter-trading, which is a type of trading that comes with some significant benefits.\r\n\r\n### Inter-trading is relative\r\n\r\nIt doesn't matter *much* what the overall market is doing, because you're always trading relative to the current price. Your market pair is `COINX@Exchange1/COINX@Exchange2`, rather than `COINX/COINZ` on a single exchange. Not only that, but the idea isn't to hold onto the coin; on the contrary, you want to buy, transfer and sell the coin as quickly as possible to guarantee profit.\r\n\r\n### Inter-trading isn't predictive\r\n\r\nInter-trading is based on the present, not the future. Actions when inter-trading are determined by what *is*  happening, not what you _think will happen_. It's the equivalent of deciding what to wear right now, based on the current weather, and deciding what to pack for a trip based on the forecast for next week: the former has a far lower probability of going wrong than the latter. Assuming there's sufficient volume on both the origin and target exchange, the probability of you coming away with more coin than you started with is very high, as long as you look out for the pitfalls (see below).\r\n\r\n## What are the risks of inter-trading?\r\n\r\nAs I developed [InterTrader](/#download) I spent some time using it to trade between exchanges. I wanted to ensure that the app truly facilitated this type of trading, and the only way to do so was to use it as intended. In doing so, I came to realise that while there are definite benefits to inter-trading, it comes with its own set of gotchas.\r\n\r\n### Is it the same coin? Avoid Coin-clash!\r\n\r\nIt doesn't happen _too_ often, but once in a while coins pop up that share the same ticker symbol. For example, CrowdCoin and CryCash both use CRC. For this reason, you need to be careful when comparing prices and purchasing based on a large potential profit. That huge price difference should be considered a red flag; although it won't always be too good to be true, it _usually_ is. Make sure you verify the prices are for the same coin!\r\n\r\n### Is there enough volume?\r\n\r\nIt can be overlooked or misread — I did it a couple of times, but thankfully with pretty small trades. You need to ensure there's both enough to buy on the origin exchange, **and sell** on the target exchange. This means checking the orderbooks and ensuring that the high value bids aren't for lower quantities than you need to sell to make your profit.\r\n\r\n### Are the wallets online?\r\n\r\nThis is a big one, and probably the most common problem I've encountered.  If there' s sufficient volume I suggest checking the wallet statuses next. It's a horrible feeling purchasing some coin and attempting to transfer it for that juicy profit, only to realise that withdrawals for that currency are disabled, or deposits on the target exchange are. At this point you either sell on the origin exchange at a loss, or more wisely, *hodl* and wait for the price to increase, or for the target exchange wallet to become active again.\r\n\r\n### Is the blockchain active?\r\n\r\nIt didn't even cross my mind that this might be something to consider when I started inter-trading, because why on Earth would a coin continue to be traded that doesn't have an active blockchain? Welcome to crypto... \r\n\r\nI learned the hard way when I tried to inter-trade BitcoinDark (BTCD), and realised too late that that blockchain is only barely limping along. Since the BitcoinDark/Komodo coin swap, BTCD has been pretty much abandoned. At the time of writing, it has been almost a week and a half and I've still only got 5 of 6 required transaction confirmations to get access to my funds on TradeSatoshi. [The last block was mined 17 days ago](https://www.blockexperts.com/btcd), according to Block Experts (although I'm seriously questioning how up-to-date their BTCD block explorer is). I thought I'd try to speed things up by installing the wallet and syncing it, but syncing a blockchain that has 1.6 million blocks takes a non-trivial amount of time. It has been three days and the wallet still hasn't synced.\r\n\r\nIf you don't want to end up with your coins in limbo, make sure you check the blockchain activity for coins you're not familiar with. And, of course, avoid BitcoinDark.\r\n\r\n### Is a reasonable number of confirmations required?\r\n\r\nSpeaking of transaction confirmations, the number required before deposited funds are available to use in your account vary from exchange to exchange. Take, for example, VeriumReserve (VRM): Bittrex requires 30 confirmations, Livecoin requires 7, yet Cryptopia requires **200**. I let them know what I thought about that in a support ticket and via [Twitter](https://twitter.com/LamboMoonClub/status/999982634653667328). I'll be surprised if they act on my recommendation, though. The moral of the story is, make sure you check the number of confirmations required for any coins you've not deposited before. This information might live in a listing page, or might only be available when you attempt to get the deposit address. It's worthwhile looking before you leap.\r\n\r\n## Is it worth it?\r\n\r\nWhether or not inter-trading is a worthwhile endeavour is for the individual to decide. For some it will make sense, for others it won't. The app takes _a lot_ of the work out of finding profitable inter-trades by doing all the comparisons and calculations for you, and it does this across 5000+ pairs on over a dozen exchanges. It also indicates when it finds wallet or trade pair issues, so you can skip potentially troublesome trades if you choose. Not only that, but it gives you access to the orderbooks right in the app, so you don't need to bounce around between exchanges in your browser to see if the there's sufficient volume.\r\n\r\nAll this means that inter-trading is a hell of a lot easier than it otherwise would have been. When I consider the potential, I compare it to a bank account (or PoS): ordinarily I'll be lucky to earn 5% on my investment in a year, but inter-trading potentially allows you to as much on a daily basis.\r\n\r\nThe only way to know for sure if it's worth your while is to look at what's available and the potential profit to be made. Check out [InterTrader](/#download) to see how much you could make.",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "amp": "1",
  "created": "2018-05-29T14:09:45.839Z",
  "updated": "2018-07-24T07:59:46.648Z",
  "published": "2018-05-29T14:35:35.893Z",
  "contentType": "page",
  "id": "HkfNykoym"
}