{
  "title": "Refining your search",
  "subtitle": "Filtering profitable cryptocurrency pairs",
  "slug": "refining-your-search",
  "section": "user-guide/finding-profitable-cryptocurrency-pairs",
  "url": "/user-guide/finding-profitable-cryptocurrency-pairs/refining-your-search/",
  "body": "## Refining your search\r\n\r\nIf you're not getting the results you want from the search page, whether too few or too many, there are a number of parameters you can change to refine your search and improve the results.\r\n\r\nTap the funnel <ion-icon name=\"funnel\"></ion-icon> icon in the top right corner of the page and it will reveal search form.\r\n\r\n<span class=\"screenshot\">\r\n![Analysis search form](/gin-data/images/1527772574406-analysis-form.png)\r\n</span>\r\n\r\n### Max <span class=\"buy\">buy</span> % difference\r\n\r\nThis is the difference between the lowest and highest <span class=\"buy\">buy</span> across all the exchanges in InterTrader listing that trade pair. InterTrader defaults to a fairly liberal default of **500%**. This is to ensure that the rare but genuine opportunities that have significant price differences across exchanges aren't missed.\r\n\r\n### Max <span class=\"sell\">sell</span> % difference\r\n\r\nThis is the difference between the lowest and highest <span class=\"sell\">sell</span> across all the exchanges in InterTrader listing that trade pair. InterTrader defaults to a fairly liberal default of **500%**. This is to ensure that the rare but genuine opportunities that have significant price differences across exchanges aren't missed.\r\n\r\n> *If you find you're getting a lot of false positives, try lowering the  **Max buy % difference** and/or **Max sell % difference**. Generally speaking, the higher these values, the more likely it is they're being skewed, either by wallet/exchange issues or [coin-clash](/user-guide/quick-reference/#glossary-of-intertrader-terms \"Quick reference\").\r\n  \r\n### Min profit %\r\n\r\nOnly results that have at least the profit specified will be returned. The default is **3%**.\r\n\r\n### Min no. of exchanges\r\n\r\nOnly trade pairs that are on at least this number of exchanges will be returned. The default minimum is **2**.\r\n\r\n### Currency\r\n\r\nYou can limit the currency the coin is paired with if you're only interested in, for example, BTC pairs. By default, InterTrader includes all currencies.\r\n\r\n### Buy only at...\r\n\r\nIf you are only interested in opportunities to buy on specific exchanges, you can use this option to select them. Only trade pairs that have a cheap <span class=\"sell\">sell</span> price on those exchanges will be returned. By default, all exchanges are included.\r\n\r\n### Sell only at...\r\n\r\nIf you are only interested in opportunities to sell on specific exchanges, you can use this option to select them. Only trade pairs that have a high <span class=\"buy\">buy</span> price on those exchanges will be returned. By default, all exchanges are included.\r\n\r\n### Order by...\r\n\r\nResults are ordered  by **Profit** by default, but can be ordered by any of the following:\r\n\r\n* Profit\r\n* Avg. <span class=\"buy\">Buy</span> price\r\n* Avg. <span class=\"sell\">Sell</span> price\r\n* Symbol\r\n* Number of exchanges\r\n\r\n### Sort direction\r\n\r\nResults can be sorted in descending (highest to lowest) or ascending (lowest to highest) value. The default sort direction is **Descending**.\r\n\r\n### Max no. of results\r\n\r\nLimit the number of results by setting the maximum number of results. The default is **100**.",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2018-05-31T14:36:21.190Z",
  "updated": "2018-06-06T17:16:31.584Z",
  "published": "2018-06-06T17:12:47.400Z",
  "contentType": "page",
  "id": "Hy6DdtTyQ"
}